app/controllers/index_controller.rb

  def index
	@post = Post.find_by_id('2')
---
SELECT * FROM "posts" WHERE ("posts"."id" = '1') LIMIT 1